export default [
    {
        title: '中国',
        value: 'CN',
        child: [
            {
                title: '中国大陆',
                value: 'CN',
                child: {
                    CN: '中国大陆'
                    // '北京',
                    // '天津',
                    // '河北',
                    // '山西',
                    // '内蒙古',
                    // '辽宁',
                    // '吉林',
                    // '黑龙江',
                    // '上海',
                    // '江苏',
                    // '浙江',
                    // '安做',
                    // '福建',
                    // '江西',
                    // '山东',
                    // '河南',
                    // '湖北',
                    // '湖南',
                    // '广东',
                    // '广西',
                    // '海南',
                    // '重庆',
                    // '四川',
                    // '贵州',
                    // '云南',
                    // '西藏',
                    // '陕西',
                    // '甘肃',
                    // '青海',
                    // '宁夏',
                    // '新疆'
                }
            },
            {
                title: '港澳台',
                value: 'HK|MO|TW',
                child: {
                    HK: '中国-香港',
                    MO: '中国-澳门',
                    TW: '中国-台湾'
                }
            }
        ]
    },
    {
        title: '亚洲',
        value: 'ASIA',
        child: [
            {
                title: '东亚',
                // value 构造数据时用child数据 加 | 拼接
                value: '',
                child: {
                    MN: '蒙古',
                    KP: '朝鲜',
                   KR: '韩国',
                    JP: '日本'
                }
            },
            {
                title: '东南亚',
                value: '',
                child: {
                    BN: '文莱',
                    KH: '柬埔寨',
                    TL: '东帝汶',
                    ID: '印度尼西亚',
                    LA: '老挝',
                    MY: '马来西亚',
                    MM: '缅甸',
                    PH: '菲律宾',
                    SG: '新加坡',
                    TH: '泰国',
                    VN: '越南'
                }
            },
            {
                title: '南亚',
                child: {
                    BD: '孟加拉',
                    BT: '不丹',
                    IN: '印度',
                    MV: '马尔代夫',
                    NP: '尼泊尔',
                    PK: '巴基斯坦',
                    LK: '斯里兰卡'
                }
            },
            {
                title: '中亚',
                child: {
                    KZ: '哈萨克斯坦',
                    KG: '吉尔吉斯斯坦',
                    TJ: '塔吉克斯坦',
                    TM: '土库曼斯坦',
                    UZ: '乌兹别克斯坦'
                }
            },
            {
                title: '西亚',
                child: {
                    AF: '阿富汗',
                    IQ: '伊拉克',
                    IR: '伊朗',
                    SY: '叙利亚',
                    JO: '约旦',
                    LB: '黎巴嫩',
                    IL: '以色列',
                    PS: '巴勒斯坦',
                    SA: '沙特阿拉伯',
                    BH: '巴林',
                    QA: '卡塔尔',
                    KW: '科威特',
                    AE: '阿联酋',
                    OM: '阿曼',
                    YE: '也门',
                    GE: '格鲁吉亚',
                    AM: '亚美尼亚',
                    AZ: '阿塞拜疆',
                    TR: '土耳其',
                    CY: '塞浦路斯'
                }
            }
        ]
    },
    {
        title: '美洲',
        value: 'AMERICA',
        child: [
            {
                title: '北美洲',
                child: {
                    US: '美国',
                    CA: '加拿大',
                    MX: '墨西哥'
                }
            },
            {
                title: '南美洲',
                child: {
                    BR: '巴西',
                    CL: '智利',
                    EC: '厄瓜多尔',
                    CO: '哥伦比亚',
                    VE: '委内瑞拉',
                    AR: '阿根廷',
                    GY: '圭亚那',
                    GF: '法属圭亚那',
                    SR: '苏里南',
                    PE: '秘鲁',
                    BO: '玻利维亚',
                    UY: '乌拉圭',
                    PY: '巴拉圭'
                }
            },
            {
                title: '中美洲',
                child: {
                    GT: '危地马拉',
                    BZ: '伯利兹',
                    SV: '萨尔瓦多',
                    HN: '洪都拉斯',
                    NI: '尼加拉瓜',
                    CR: '哥斯达黎加',
                    PA: '巴拿马'
                }
            },
            {
                title: '加勒比海地区',
                child: {
                    BS: '巴哈马',
                    CU: '古巴',
                    JM: '牙买加',
                    HT: '海地',
                    DO: '多米尼加',
                    PR: '波多黎各',
                    KY: '开曼群岛',
                    BM: '百慕大群岛',
                    TT: '特立尼达和多巴哥'
                }
            }
        ]
    },

    {
        title: '欧洲',
        value: 'EUROPE',
        child: [
            {
                title: '北欧',
                child: {
                    FI: '芬兰',
                    SE: '瑞典',
                    NO: '挪威',
                    IS: '冰岛',
                    DK: '丹麦',
                    FO: '法罗群岛'
                }
            },
            {
                title: '东欧',
                child: {
                    EE: '爱沙尼亚',
                    LV: '拉脱维亚',
                    LT: '立陶宛',
                    BY: '白俄罗斯',
                    RU: '俄罗斯',
                    UA: '乌克兰',
                    MD: '摩尔多瓦'
                }
            },
            {
                title: '中欧',
                child: {
                    PL: '波兰',
                    SK: '斯洛伐克',
                    HU: '匈牙利',
                    DE: '德国',
                    AT: '奥地利',
                    CH: '瑞士',
                    LI: '列支敦士登',
                    CZ: '捷克'
                }
            },
            {
                title: '西欧',
                child: {
                    GB: '英国',
                    IE: '爱尔兰',
                    NL: '荷兰',
                    BE: '比利时',
                    LU: '卢森堡',
                    FR: '法国',
                    MC: '摩纳哥'
                }
            },
            {
                title: '南欧',
                child: {
                    RO: '罗马尼亚',
                    BG: '保加利亚',
                    RS: '塞尔维亚',
                    MK: '马其顿',
                    AL: '阿尔巴尼亚',
                    GR: '希腊',
                    SI: '斯洛文尼亚',
                    HR: '克罗地亚',
                    IT: '意大利',
                    VA: '梵蒂冈',
                    SM: '圣马力诺',
                    MT: '马耳他',
                    ES: '西班牙',
                    PT: '葡萄牙',
                    AD: '安道尔'
                }
            }
        ]
    },

    {
        title: '非洲',
        value: 'AFRICA',
        child: [
            {
                title: '北非',
                child: {
                    EG: '埃及',
                    LY: '利比亚',
                    SD: '苏丹',
                    TN: '突尼斯',
                    DZ: '阿尔及利亚',
                    MA: '摩洛哥'
                }
            },
            {
                title: '东非',
                child: {
                    ET: '埃塞俄比亚',
                    ER: '厄立特里亚',
                    SO: '索马里',
                    DJ: '吉布提',
                    KE: '肯尼亚',
                    TZ: '坦桑尼亚',
                    UG: '乌干达',
                    RW: '卢旺达',
                    BI: '布隆迪',
                    SC: '塞舌尔'
                }
            },
            {
                title: '中非',
                child: {
                    TD: '乍得',
                    CF: '中非',
                    CM: '喀麦隆',
                    GQ: '赤道几内亚',
                    CG: '刚果',
                    ST: '圣多美和普林西比'
                }
            },
            {
                title: '西非',
                child: {
                    MR: '毛里塔尼亚',
                    SN: '塞内加尔',
                    GM: '冈比亚',
                    ML: '马里',
                    BF: '布基纳法索',
                    GN: '几内亚',
                    GW: '几内亚比绍',
                    CV: '佛得角',
                    SL: '塞拉利昂',
                    LR: '利比里亚',
                    GH: '加纳',
                    TG: '多哥',
                    NG: '尼日利亚',
                    BJ: '贝宁',
                    NE: '尼日尔'
                }
            },
            {
                title: '南非',
                child: {
                    ZM: '赞比亚',
                    AO: '安哥拉',
                    ZW: '津巴布韦',
                    MW: '马拉维',
                    MZ: '莫桑比克',
                    BW: '博茨瓦纳',
                    NA: '纳米比亚',
                    ZA: '南非',
                    SZ: '斯威士兰',
                    LS: '莱索托',
                    MG: '马达加斯加',
                    KM: '科摩罗',
                    MU: '毛里求斯'
                }
            }
        ]
    },

    {
        title: '大洋洲',
        value: 'OCEANIA',
        child: [
            {
                title: '大洋洲',
                child: {
                    AU: '澳大利亚',
                    NZ: '新西兰',
                    GU: '关岛',
                    PG: '巴布亚新几内亚'
                }
            }
        ]
    }
]
